app/controllers/questions_controller.rb

INSERT INTO "questions" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-09-23 08:01:33.749016"], ["updated_at", "2020-09-23 08:01:33.749016"]]
INSERT INTO "topics" ("topic_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["topic_name", "zz"], ["user_id", 1], ["created_at", "2020-09-23 08:45:36.135193"], ["updated_at", "2020-09-23 08:45:36.135193"]]
SELECT "topics".* FROM "topics" ORDER BY "topics"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "questions" ("question", "topic_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question", "gdgtdh"], ["topic_id", 1], ["user_id", 1], ["created_at", "2020-09-23 08:45:36.236233"], ["updated_at", "2020-09-23 08:45:36.236233"]]
---
  def create
    params[:question][:user_id] = current_user.id
    @topic = Topic.create(:user_id => current_user.id,:topic_name => params[:question][:topic_name])
    params[:question][:topic_id] = Topic.last.id
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save

INSERT INTO "answers" ("answer", "question_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["answer", "aaaa"], ["question_id", 3], ["user_id", 1], ["created_at", "2020-09-23 09:17:45.905527"], ["updated_at", "2020-09-23 09:17:45.905527"]]
---
  def update
    @answer = Answer.create(:user_id => current_user.id,:answer => params[:question][:answer],:question_id => @question.id)